app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments"

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)

  def create
    @comment = Comment.new(params[:comment])
    if @comment.save
---
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES(1, 'Test', '2013-01-06 05:14:54', '2013-01-06 05:14:54')

  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(params[:comment])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 2)
UPDATE "comments" SET "content" = 'Test 3', "updated_at" = '2013-01-06 05:27:23' WHERE "id" = 2

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1