app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES('test', '2013-01-06 04:59:07', '2013-01-06 04:59:07')

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "content" = 'First test post', "updated_at" = '2013-01-06 05:47:00' WHERE "id" = 1