app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_hash", "password_salt", "created_at", "updated_at") VALUES('test', 'yulia.bro@gmail.com', '29f4ef26950bd82d83e754eededd89795a387a53', 'a006aeeeaf5d98c34f1da9f690b14a015b89b605', '2013-01-06 05:59:39', '2013-01-06 05:59:39')
---
  def create
    @user = User.new(params[:user])
    if @user.save